In [ ]:
Merge and join
data wraling of adults data
Data wraling of Health care payment data

In [151]:
import pandas as  pd
import numpy as np

In [7]:
df1 = pd.DataFrame({'name':["a","b","c"],"Age":[11,22,33]})

In [8]:
df2 = pd.DataFrame({'name':["a","b","c"],"marks":[11,22,33]})

In [9]:
pd.merge(df1,df2)

  name  Age  marks
0    a   11     11
1    b   22     22
2    c   33     33

In [10]:
pd.merge(df1,df2, on = "name")

  name  Age  marks
0    a   11     11
1    b   22     22
2    c   33     33

In [12]:
df1 = pd.DataFrame({'name':["a","b","c"],"Age":[11,22,33]})

In [13]:
df2 = pd.DataFrame({'nameid':["a","b","c"],"marks":[11,22,33]})

Sometimes dataframe have different column name

In [15]:
pd.merge(df1,df2, left_on = "name",right_on = "nameid")

  name  Age_x nameid  Age_y
0    a     11      a     11
1    b     22      b     22
2    c     33      c     33

In [16]:
df1 = pd.DataFrame({'name':["a","b","c","a","d"],"Age":[11,22,33,44,22]})

In [17]:
pd.merge(df1,df2,left_on = "name", right_on = "nameid")

  name  Age_x nameid  Age_y
0    a     11      a     11
1    a     44      a     11
2    b     22      b     22
3    c     33      c     33

=> Many to many relatioship

In [21]:
df1 = pd.DataFrame({'name':["a","b","c","a","d"],"Age":[11,22,33,44,22]})
df2 = pd.DataFrame({'nameid':["a","b","c","b"],"marks":[111,222,333,332]})

In [22]:
pd.merge(df1,df2,left_on = "name", right_on = "nameid")

  name  Age nameid  marks
0    a   11      a    111
1    a   44      a    111
2    b   22      b    222
3    b   22      b    332
4    c   33      c    333

### Data Wraling of adults Data

In [93]:
cols = ['age','workclass','fnlwgt','education','education-num','marital-status','occupation','relationship'
        ,'race','sex','capital-gain','capital-loss','hours-per-week','native-country','Salary']
adult_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/adult.data.txt',names = cols)

In [98]:
adult_data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,Salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [29]:
adult_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
age               32561 non-null int64
workclass         32561 non-null object
fnlwgt            32561 non-null int64
education         32561 non-null object
education-num     32561 non-null int64
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
native-country    32561 non-null object
Salary            32561 non-null object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

Identity the String Columns

In [99]:
cat_adult_data = adult_data.select_dtypes(include = ['object'])

In [100]:
cat_adult_data['native-country'].unique()

array([' United-States', ' Cuba', ' Jamaica', ' India', ' ?', ' Mexico',
       ' South', ' Puerto-Rico', ' Honduras', ' England', ' Canada',
       ' Germany', ' Iran', ' Philippines', ' Italy', ' Poland',
       ' Columbia', ' Cambodia', ' Thailand', ' Ecuador', ' Laos',
       ' Taiwan', ' Haiti', ' Portugal', ' Dominican-Republic',
       ' El-Salvador', ' France', ' Guatemala', ' China', ' Japan',
       ' Yugoslavia', ' Peru', ' Outlying-US(Guam-USVI-etc)', ' Scotland',
       ' Trinadad&Tobago', ' Greece', ' Nicaragua', ' Vietnam', ' Hong',
       ' Ireland', ' Hungary', ' Holand-Netherlands'], dtype=object)

In [36]:
cat_adult_data['native-country'].value_counts()

 United-States                 29170
 Mexico                          643
 ?                               583
 Philippines                     198
 Germany                         137
 Canada                          121
 Puerto-Rico                     114
 El-Salvador                     106
 India                           100
 Cuba                             95
 England                          90
 Jamaica                          81
 South                            80
 China                            75
 Italy                            73
 Dominican-Republic               70
 Vietnam                          67
 Guatemala                        64
 Japan                            62
 Poland                           60
 Columbia                         59
 Taiwan                           51
 Haiti                            44
 Iran                             43
 Portugal                         37
 Nicaragua                        34
 Peru                             31
 Greece                           29
 France                           29
 Ecuador                          28
 Ireland                          24
 Hong                             20
 Cambodia                         19
 Trinadad&Tobago                  19
 Thailand                         18
 Laos                             18
 Yugoslavia                       16
 Outlying-US(Guam-USVI-etc)       14
 Hungary                          13
 Honduras                         13
 Scotland                         12
 Holand-Netherlands                1
Name: native-country, dtype: int64

In [ ]:
## Cleaning the white spaces  (remove the white spaces before and after the  name of the country)

In [92]:
cat_adult_data['native-country'] = cat_adult_data['native-country'].str.strip()

KeyError: 'native-country'

In [39]:
cat_adult_data['native-country'].unique()

array(['United-States', 'Cuba', 'Jamaica', 'India', '?', 'Mexico',
       'South', 'Puerto-Rico', 'Honduras', 'England', 'Canada', 'Germany',
       'Iran', 'Philippines', 'Italy', 'Poland', 'Columbia', 'Cambodia',
       'Thailand', 'Ecuador', 'Laos', 'Taiwan', 'Haiti', 'Portugal',
       'Dominican-Republic', 'El-Salvador', 'France', 'Guatemala',
       'China', 'Japan', 'Yugoslavia', 'Peru',
       'Outlying-US(Guam-USVI-etc)', 'Scotland', 'Trinadad&Tobago',
       'Greece', 'Nicaragua', 'Vietnam', 'Hong', 'Ireland', 'Hungary',
       'Holand-Netherlands'], dtype=object)

In [79]:
cat_adult_data['native-country'].fillna({"?":"NA"},inplace = True)

In [75]:
cat_adult_data['native-country'].unique()

array(['United-States', 'Cuba', 'Jamaica', 'India', '?', 'Mexico',
       'South', 'Puerto-Rico', 'Honduras', 'England', 'Canada', 'Germany',
       'Iran', 'Philippines', 'Italy', 'Poland', 'Columbia', 'Cambodia',
       'Thailand', 'Ecuador', 'Laos', 'Taiwan', 'Haiti', 'Portugal',
       'Dominican-Republic', 'El-Salvador', 'France', 'Guatemala',
       'China', 'Japan', 'Yugoslavia', 'Peru',
       'Outlying-US(Guam-USVI-etc)', 'Scotland', 'Trinadad&Tobago',
       'Greece', 'Nicaragua', 'Vietnam', 'Hong', 'Ireland', 'Hungary',
       'Holand-Netherlands'], dtype=object)

In [78]:
for col in cat_adult_data.columns:
    cat_adult_data[col] = cat_adult_data[col].str.strip()

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [84]:
num_adult_data = adult_data.select_dtypes(exclude = ['object'])

In [85]:
num_adult_data.head()

   age  fnlwgt  education-num  capital-gain  capital-loss  hours-per-week
0   39   77516             13          2174             0              40
1   50   83311             13             0             0              13
2   38  215646              9             0             0              40
3   53  234721              7             0             0              40
4   28  338409             13             0             0              40

In [86]:
num_adult_data.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

In [88]:
num_adult_data.isna().sum()

age               0
fnlwgt            0
education-num     0
capital-gain      0
capital-loss      0
hours-per-week    0
dtype: int64

In [107]:
Transform_data =  pd.concat([cat_adult_data, num_adult_data],axis =1)

In [109]:
Transform_data.Salary.value_counts()

 <=50K    24720
 >50K      7841
Name: Salary, dtype: int64

In [113]:
adult_data.groupby(["Salary"])['hours-per-week'].mean()

Salary
 <=50K    38.840210
 >50K     45.473026
Name: hours-per-week, dtype: float64

In [118]:
Transform_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
workclass         32561 non-null object
education         32561 non-null object
marital-status    32561 non-null object
occupation        32561 non-null object
relationship      32561 non-null object
race              32561 non-null object
sex               32561 non-null object
native-country    32561 non-null object
Salary            32561 non-null object
age               32561 non-null int64
fnlwgt            32561 non-null int64
education-num     32561 non-null int64
capital-gain      32561 non-null int64
capital-loss      32561 non-null int64
hours-per-week    32561 non-null int64
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [122]:
Transform_data.pivot_table(index = 'marital-status',values = "hours-per-week",columns= "occupation", aggfunc = np.mean)

occupation,?,Adm-clerical,Armed-Forces,Craft-repair,Exec-managerial,Farming-fishing,Handlers-cleaners,Machine-op-inspct,Other-service,Priv-house-serv,Prof-specialty,Protective-serv,Sales,Tech-support,Transport-moving
marital-status,,,,,,,,,,,,,,,
Divorced,35.345946,39.310134,NaN,42.622845,44.991722,44.062500,40.398438,40.895307,37.560878,29.392857,42.302412,44.329114,42.048387,40.492857,46.364641
Married-AF-spouse,8.500000,40.600000,NaN,57.333333,40.000000,44.000000,NaN,NaN,28.750000,NaN,46.666667,40.000000,47.500000,NaN,80.000000
Married-civ-spouse,31.786499,39.322515,42.666667,42.997660,46.134615,50.106087,40.766595,41.973764,38.775934,38.062500,44.203198,43.926893,45.392664,41.019802,45.410463
Married-spouse-absent,34.620690,36.457627,NaN,41.807692,47.096774,40.166667,41.434783,41.269231,36.677966,39.000000,39.574468,40.000000,38.911765,36.166667,46.473684
Never-married,32.517510,35.869893,39.666667,40.427752,42.434293,42.806228,35.399425,39.092820,32.106642,34.283582,39.996759,40.044872,35.178923,37.646526,42.100000
Separated,33.378788,39.346939,NaN,41.970874,42.787234,43.944444,40.526316,39.011905,37.347368,28.666667,40.626263,43.312500,38.419355,37.821429,42.081081
Widowed,24.320261,33.257669,NaN,35.609756,38.333333,39.434783,36.000000,37.679245,30.661017,30.500000,36.152174,35.222222,35.447619,32.368421,38.080000

In [127]:
Transform_data[(Transform_data.occupation == "Armed-forces") & (Transform_data['marital-status'] == "Divorced")]

Empty DataFrame
Columns: [workclass, education, marital-status, occupation, relationship, race, sex, native-country, Salary, age, fnlwgt, education-num, capital-gain, capital-loss, hours-per-week]
Index: []

In [154]:
payments_data = pd.read_csv('https://raw.githubusercontent.com/edyoda/data-science-complete-tutorial/master/Data/payments-data.csv')

In [155]:
payments_data.head()

,Change_Type,Covered_Recipient_Type,Teaching_Hospital_CCN,Teaching_Hospital_ID,Teaching_Hospital_Name,Physician_Profile_ID,Physician_First_Name,Physician_Middle_Name,Physician_Last_Name,Physician_Name_Suffix,...,Product_Category_or_Therapeutic_Area_4,Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_4,Associated_Drug_or_Biological_NDC_4,Covered_or_Noncovered_Indicator_5,Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_5,Product_Category_or_Therapeutic_Area_5,Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_5,Associated_Drug_or_Biological_NDC_5,Program_Year,Payment_Publication_Date
0,NEW,Covered Recipient Physician,NaN,NaN,NaN,132655.0,GREGG,D,ALZATE,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2016,06/30/2017
1,NEW,Covered Recipient Physician,NaN,NaN,NaN,132655.0,GREGG,D,ALZATE,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2016,06/30/2017
2,NEW,Covered Recipient Physician,NaN,NaN,NaN,1006832.0,SADEER,JABBAR,ALZUBAIDI,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2016,06/30/2017
3,NEW,Covered Recipient Physician,NaN,NaN,NaN,1006832.0,SADEER,JABBAR,ALZUBAIDI,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2016,06/30/2017
4,NEW,Covered Recipient Physician,NaN,NaN,NaN,1006832.0,SADEER,JABBAR,ALZUBAIDI,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2016,06/30/2017

### Cleaning the Data

### Droping All the columns where more than 5000 rows are NA

In [137]:
cols_to_be_removed = []
for col in payments_data.columns:
    if payments_data[col].isnull().sum() > 5000:
        cols_to_be_removed.append(col)

In [157]:
payments_data.drop(columns=cols_to_be_removed,axis=1, inplace=True)
payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29999 entries, 0 to 29998
Data columns (total 36 columns):
Change_Type                                                         29999 non-null object
Covered_Recipient_Type                                              29999 non-null object
Physician_Profile_ID                                                29920 non-null float64
Physician_First_Name                                                29920 non-null object
Physician_Last_Name                                                 29918 non-null object
Recipient_Primary_Business_Street_Address_Line1                     29999 non-null object
Recipient_City                                                      29999 non-null object
Recipient_State                                                     29999 non-null object
Recipient_Zip_Code                                                  29999 non-null object
Recipient_Country                                                   29999 non-null object
Physician_Primary_Type                                              29920 non-null object
Physician_Specialty                                                 29902 non-null object
Physician_License_State_code1                                       29920 non-null object
Submitting_Applicable_Manufacturer_or_Applicable_GPO_Name           29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_ID         29999 non-null int64
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Name       29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_State      29995 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Country    29999 non-null object
Total_Amount_of_Payment_USDollars                                   29999 non-null float64
Date_of_Payment                                                     29999 non-null object
Number_of_Payments_Included_in_Total_Amount                         29999 non-null int64
Form_of_Payment_or_Transfer_of_Value                                29999 non-null object
Nature_of_Payment_or_Transfer_of_Value                              29999 non-null object
Physician_Ownership_Indicator                                       29920 non-null object
Third_Party_Payment_Recipient_Indicator                             29999 non-null object
Charity_Indicator                                                   27076 non-null object
Delay_in_Publication_Indicator                                      29999 non-null object
Record_ID                                                           29999 non-null int64
Dispute_Status_for_Publication                                      29999 non-null object
Related_Product_Indicator                                           29999 non-null object
Covered_or_Noncovered_Indicator_1                                   29087 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1           29087 non-null object
Product_Category_or_Therapeutic_Area_1                              28989 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1            28787 non-null object
Program_Year                                                        29999 non-null int64
Payment_Publication_Date                                            29999 non-null object
dtypes: float64(2), int64(4), object(30)
memory usage: 8.2+ MB

covert Date format columns to Date format

In [153]:
payments_data = pd.to_datetime(payments_data['Date_of_Payment'])

KeyError: 'Date_of_Payment'

In [147]:
payments_data[payments_data.Date_of_Payment == '2016-07-13'].Date_of_Payment

AttributeError: 'Series' object has no attribute 'Date_of_Payment'

### Create full name column from first_name and last_name

In [159]:
payments_data['full_name'] = payments_data.Physician_First_Name + ' '+ payments_data.Physician_Last_Name

In [161]:
payments_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29999 entries, 0 to 29998
Data columns (total 37 columns):
Change_Type                                                         29999 non-null object
Covered_Recipient_Type                                              29999 non-null object
Physician_Profile_ID                                                29920 non-null float64
Physician_First_Name                                                29920 non-null object
Physician_Last_Name                                                 29918 non-null object
Recipient_Primary_Business_Street_Address_Line1                     29999 non-null object
Recipient_City                                                      29999 non-null object
Recipient_State                                                     29999 non-null object
Recipient_Zip_Code                                                  29999 non-null object
Recipient_Country                                                   29999 non-null object
Physician_Primary_Type                                              29920 non-null object
Physician_Specialty                                                 29902 non-null object
Physician_License_State_code1                                       29920 non-null object
Submitting_Applicable_Manufacturer_or_Applicable_GPO_Name           29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_ID         29999 non-null int64
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Name       29999 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_State      29995 non-null object
Applicable_Manufacturer_or_Applicable_GPO_Making_Payment_Country    29999 non-null object
Total_Amount_of_Payment_USDollars                                   29999 non-null float64
Date_of_Payment                                                     29999 non-null object
Number_of_Payments_Included_in_Total_Amount                         29999 non-null int64
Form_of_Payment_or_Transfer_of_Value                                29999 non-null object
Nature_of_Payment_or_Transfer_of_Value                              29999 non-null object
Physician_Ownership_Indicator                                       29920 non-null object
Third_Party_Payment_Recipient_Indicator                             29999 non-null object
Charity_Indicator                                                   27076 non-null object
Delay_in_Publication_Indicator                                      29999 non-null object
Record_ID                                                           29999 non-null int64
Dispute_Status_for_Publication                                      29999 non-null object
Related_Product_Indicator                                           29999 non-null object
Covered_or_Noncovered_Indicator_1                                   29087 non-null object
Indicate_Drug_or_Biological_or_Device_or_Medical_Supply_1           29087 non-null object
Product_Category_or_Therapeutic_Area_1                              28989 non-null object
Name_of_Drug_or_Biological_or_Device_or_Medical_Supply_1            28787 non-null object
Program_Year                                                        29999 non-null int64
Payment_Publication_Date                                            29999 non-null object
full_name                                                           29918 non-null object
dtypes: float64(2), int64(4), object(31)
memory usage: 8.5+ MB

In [166]:
payments_data.groupby(["Physician_Specialty"]).Total_Amount_of_Payment_USDollars.mean()

Physician_Specialty
Allopathic & Osteopathic Physicians|Allergy & Immunology                                                                        53.360000
Allopathic & Osteopathic Physicians|Allergy & Immunology|Allergy                                                                19.737500
Allopathic & Osteopathic Physicians|Anesthesiology                                                                              26.665050
Allopathic & Osteopathic Physicians|Anesthesiology|Addiction Medicine                                                           21.370000
Allopathic & Osteopathic Physicians|Anesthesiology|Critical Care Medicine                                                       79.120000
                                                                                                                                  ...
Podiatric Medicine & Surgery Service Providers|Podiatrist|Foot Surgery                                                          33.801111
Podiatric Medicine & Surgery Service Providers|Podiatrist|Primary Podiatric Medicine                                           337.564167
Respiratory, Developmental, Rehabilitative and Restorative Service Providers|Physical Therapist|Electrophysiology, Clinical     13.230000
Student, Health Care|Student in an Organized Health Care Education/Training Program                                             18.990966
Technologists, Technicians & Other Technical Service Providers|Spec/Tech, Cardiovascular|Vascular Specialist                   135.950000
Name: Total_Amount_of_Payment_USDollars, Length: 157, dtype: float64

In [ ]:
Assignments for today:
    1. Find city wise amount payable
    
    2. Find the total charity payments

In [169]:
payments_data.groupby(['Recipient_City']).Total_Amount_of_Payment_USDollars.mean()

Recipient_City
303 N CLYDE MORRIS BLVD    500.000000
ABERDEEN                    13.665000
ABILENE                     15.536250
ABINGDON                    55.187500
ABINGTON                    20.775000
                              ...
ZION                        53.815000
ZIONSVILLE                  17.080000
Zephyrhills                 13.620000
bedford                     15.803333
mansfield                   14.610000
Name: Total_Amount_of_Payment_USDollars, Length: 2424, dtype: float64

In [171]:
payments_data.groupby(['Charity_Indicator']).Total_Amount_of_Payment_USDollars.sum()

Charity_Indicator
No     4026187.70
Yes     161804.99
Name: Total_Amount_of_Payment_USDollars, dtype: float64

In [177]:
new_data = payments_data[payments_data.Charity_Indicator== "Yes"]


new_data.Total_Amount_of_Payment_USDollars.sum()

161804.99

In [ ]:
payments_data.Date_of_Payment = pd.to_datetime(payments_data.Date_of_Payment)
payments_data[payments_data.Date_of_Payment == '2016-07-13'].Date_of_Payment
payments_data[(payments_data.Date_of_Payment >= '2016-07-13') & (payments_data.Date_of_Payment <= '2016-07-15')].Date_of_Payment